#ifndef PAUSE_H_INCLUDED
#define PAUSE_H_INCLUDED

/***********************************************************************
 * 一時停止モード
 ************************************************************************/

extern int pause_msg;

void ui_pause_init(void);
void ui_pause_main(void);

/*----------------------------------------------------------------------
 * イベント処理の対処
 *----------------------------------------------------------------------*/
void pause_event_focus_out_when_exec(void);
void pause_event_focus_in_when_pause(void);
void pause_event_key_on_esc(void);
void pause_event_key_on_menu(void);



/***********************************************************************
 * リセット
 ************************************************************************/
void ui_askreset_init(void);
void ui_askreset_main(void);


/***********************************************************************
 * スピードアップ比率
 ************************************************************************/
void ui_askspeedup_init(void);
void ui_askspeedup_main(void);


/***********************************************************************
 * ディスクイメージファイル変更
 ************************************************************************/
void ui_askdiskchange_init(void);
void ui_askdiskchange_main(void);


/***********************************************************************
 * 終了
 ************************************************************************/
void ui_askquit_init(void);
void ui_askquit_main(void);



#endif /* PAUSE_H_INCLUDED */
